echemLattice/run01/constant/dPorosityInterpIn.txt
10000
(
-8.063589205536e-01
-8.071521585335e-01
-8.087387582095e-01
-8.103256053111e-01
-8.119126998336e-01
-8.135000417771e-01
-8.150876311438e-01
-8.166754679314e-01
-8.182635521423e-01
-8.198518837765e-01
-8.214404628316e-01
-8.230292893099e-01
-8.246183632092e-01
-8.262076845317e-01
-8.277972532775e-01
-8.293870694443e-01
-8.309771330343e-01
-8.325674440475e-01
-8.341580024817e-01
-8.357488083368e-01
-8.373398616152e-01
-8.389311623191e-01
-8.405227104417e-01
-8.421145059875e-01
-8.437065489566e-01
-8.452988393466e-01
-8.468913771599e-01
-8.484841623964e-01
-8.500771950538e-01
-8.516704751322e-01
-8.532640026338e-01
-8.548577775588e-01
-8.564517999069e-01
-8.580460696760e-01
-8.596405868684e-01
-8.612353514817e-01
-8.628303635182e-01
-8.644256229780e-01
-8.660211298587e-01
-8.676168841604e-01
-8.692128858876e-01
-8.708091350358e-01
-8.724056316049e-01
-8.740023755996e-01
-8.755993670129e-01
-8.771966058495e-01
-8.787940921093e-01
-8.803918257924e-01
-8.819898068964e-01
-8.835880354237e-01
-8.851865113742e-01
-8.867852347433e-01
-8.883842055357e-01
-8.899834237537e-01
-8.915828893926e-01
-8.931826024524e-01
-8.947825629355e-01
-8.963827708395e-01
-8.979832261691e-01
-8.995839289197e-01
-9.011848790911e-01
-9.027860766859e-01
-9.043875217015e-01
-9.059892141428e-01
-9.075911540050e-01
-9.091933412881e-01
-9.107957759945e-01
-9.123984581217e-01
-9.140013876723e-01
-9.156045646485e-01
-9.172079890432e-01
-9.188116608612e-01
-9.204155801025e-01
-9.220197467623e-01
-9.236241608501e-01
-9.252288223565e-01
-9.268337312862e-01
-9.284388876391e-01
-9.300442914129e-01
-9.316499426100e-01
-9.332558412280e-01
-9.348619872693e-01
-9.364683807339e-01
-9.380750216193e-01
-9.396819099281e-01
-9.412890456601e-01
-9.428964288106e-01
-9.445040593868e-01
-9.461119373863e-01
-9.477200628043e-01
-9.493284356479e-01
-9.509370559125e-01
-9.525459235980e-01
-9.541550387091e-01
-9.557644012411e-01
-9.573740111940e-01
-9.589838685702e-01
-9.605939733697e-01
...
)
