echemLattice/run01/constant/transportProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  4.0                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      transportProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

transportModel  Newtonian;

//Physical parameters

nu              nu   [0 2 -1 0 0 0 0] 8.90883e-7;

DCO             DCO  [0 2 -1 0 0 0 0] 2.4e-10;

DCR             DCR  [0 2 -1 0 0 0 0] 2.4e-10;

kappa1          kappa1 [-1 -3 3 0 0 2 0] 10000.0;

kappa2          kappa2 [-1 -3 3 0 0 2 0] 40.0;

stdPotential    stdPotential [1 2 -3 0 0 -1 0] -0.25;

Temperature     Temperature [0 0 0 1 0 0 0] 300.;

i0              i0 [0 -2 0 0 0 1 0] 0.016403;

alphaA          alphaA [0 0 0 0 0 0 0] 0.5;

alphaC          alphaC [0 0 0 0 0 0 0] 0.5;

nelec           nelec [0 0 0 0 0 0 0] 1;

a0              a0 [0 -1 0 0 0 0 0] 80000.;

porosity0       p0 [0 0 0 0 0 0 0] 0.75;

rFiber          rFiber [0 1 0 0 0 0 0] 0.00005;

permeability0   permeability0 [0 2 0 0 0 0 0] 1.0e-10;

// km_i = g_i *mag(Vel/(1 m/s))^ b_i [=] m/s

gO              gO [0 1 -1 0 0 0 0] 1.e10;

gR              gR [0 1 -1 0 0 0 0] 1.e10;

bO              bO [0 0 0 0 0 0 0] 0.0;

bR              bR [0 0 0 0 0 0 0] 0.0;

velMin          velMin [0 1 -1 0 0 0 0] 2.756e-5;

//Subscale geometry parameters

unitCellLen     unitCellLen [0 1 0 0 0 0 0] 50e-6;

printResLen     printResLen [0 1 0 0 0 0 0] 2.5e-6;

//Solver parameters

// CRef in mol / m^3, quanitity used to non-dim BV, shouldn't change
CRef            CRef [0 -3 0 0 0 0 0] 1.;

stepLength      stepLength [0 0 0 0 0 0 0] 5.0e-7;

stepLengthInit  stepLengthInit [0 0 0 0 0 0 0] 1.0e-10;

stepLengthMin  stepLengthMin [0 0 0 0 0 0 0] 1.0e-10;

stepLengthIter  stepLengthIter [0 0 0 0 0 0 0] 0;

gradPenalty     gradPenalty [0 2 0 0 0 0 0] 0.0;

velocityPenalty velocityPenalty [0 0 0 0 0 0 0] 0.0;

rFilter         rFilter [0 1 0 0 0 0 0] 1.0e-10;

volPenalty      volPenalty [0 0 0 0 0 0 0] 0.0;

qPermInterp0    qPermInterp0 [0 0 0 0 0 0 0] 0.1;

qPermInterpFinal    qPermInterpFinal [0 0 0 0 0 0 0] 1000.;

gammaTrnPermInterp0  gammaTrnPermInterp0 [0 0 0 0 0 0 0] 0.4;

gammaTrnPermInterpFinal  gammaTrnPermInterpFinal [0 0 0 0 0 0 0] 0.4;

NqPermInterp    NqPermInterp [0 0 0 0 0 0 0] 5;

qArea0          qArea0 [0 0 0 0 0 0 0] 10.;

qAreaFinal      qAreaFinal [0 0 0 0 0 0 0] 10;

NqArea          NqArea [0 0 0 0 0 0 0] 5;

betaTanh0       betaTanh0 [0 0 0 0 0 0 0] 10.0;

betaTanhMax     betaTanhMax [0 0 0 0 0 0 0] 1.0e-10;

NbetaTanh       NbetaTanh [0 0 0 0 0 0 0] 5;

etaTanh         etaTanh [0 0 0 0 0 0 0] 0.5;

deltaNSteps     deltaNsteps [0 0 0 0 0 0 0] 5.;

// ************************************************************************* //
